       IDENTIFICATION DIVISION. >>>>> 1 - DIVISIONS
       PROGRAM-ID. KUMAR.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION. >>>>>> 2 - SECTIONS
       01 WS-COST-OF-SALE PIC 9(5).
       01 WS-TAX          PIC 9(8).
       PROCEDURE DIVISION.
       START-PROGRAM             >>>>  3 - PARAGRAPHS
           MOVE 10000 TO WS-COST-OF-SALE. |
>> 5 STMTS DISPLAY WS-COST-OF-SALE      . |-> 4 - SENTENCES
           MOVE 10 TO WS-TAX.             |
           DISPLAY WS-TAX.                |
       END-PROGRAM.
              STOP RUN.
